Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPD064.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WatchLo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchLo3" edc:nmmrflags="0c" edc:nmmrid="584" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAddr" edc:desc="" edc:mask="0x1fffffff" edc:name="VAddr" edc:nzwidth="0x1d"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi" edc:nmmrflags="0t" edc:nmmrid="204" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi1" edc:nmmrflags="0a" edc:nmmrid="332" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="WatchHi2" edc:nmmrflags="0b" edc:nmmrid="460" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rn------nnnnnnnn----nnnnnnnnnnnn" edc:cname="WatchHi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="WatchHi3" edc:nmmrflags="0c" edc:nmmrid="588" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I" edc:desc="" edc:mask="0x1" edc:name="I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Mask" edc:desc="" edc:mask="0x1ff" edc:name="Mask" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASID" edc:desc="" edc:mask="0xff" edc:name="ASID" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="G" edc:desc="" edc:mask="0x1" edc:name="G" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="rrrnrrnn--nnrrrrrrrrrrrn-rrrrrrr" edc:cname="Debug" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010000000101000000000000000" edc:name="Debug" edc:nmmrflags="0t" edc:nmmrid="220" edc:nzwidth="0x20" edc:por="00000010000000101000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSS" edc:desc="" edc:mask="0x1" edc:name="DSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBp" edc:desc="" edc:mask="0x1" edc:name="DBp" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBL" edc:desc="" edc:mask="0x1" edc:name="DDBL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBS" edc:desc="" edc:mask="0x1" edc:name="DDBS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIB" edc:desc="" edc:mask="0x1" edc:name="DIB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DINT" edc:desc="" edc:mask="0x1" edc:name="DINT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIBIMPR" edc:desc="" edc:mask="0x1" edc:name="DIBIMPR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSt" edc:desc="" edc:mask="0x1" edc:name="SSt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NoSST" edc:desc="" edc:mask="0x1" edc:name="NoSST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DExcCode" edc:desc="" edc:mask="0x1f" edc:name="DExcCode" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="Ver" edc:desc="" edc:mask="0x7" edc:name="Ver" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DDBLImpr" edc:desc="" edc:mask="0x1" edc:name="DDBLImpr" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDBSImpr" edc:desc="" edc:mask="0x1" edc:name="DDBSImpr" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEXI" edc:desc="" edc:mask="0x1" edc:name="IEXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBusEP" edc:desc="" edc:mask="0x1" edc:name="DBusEP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IBusEP" edc:desc="" edc:mask="0x1" edc:name="IBusEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CountDM" edc:desc="" edc:mask="0x1" edc:name="CountDM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Halt" edc:desc="" edc:mask="0x1" edc:name="Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Doze" edc:desc="" edc:mask="0x1" edc:name="Doze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSNM" edc:desc="" edc:mask="0x1" edc:name="LSNM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NoDCR" edc:desc="" edc:mask="0x1" edc:name="NoDCR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DM" edc:desc="" edc:mask="0x1" edc:name="DM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBD" edc:desc="" edc:mask="0x1" edc:name="DBD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
