Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPD064.PIC
      <edc:SFRDef edc:_addr="0x1F810080" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnn--------------------nnnn--" edc:cname="IFS4" edc:desc="" edc:impl="0xfc00003c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--------------------0000--" edc:name="IFS4" edc:nzwidth="32" edc:por="000000--------------------0000--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AD1D24IF" edc:desc="" edc:mask="0x1" edc:name="AD1D24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IF" edc:desc="" edc:mask="0x1" edc:name="AD1D25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IF" edc:desc="" edc:mask="0x1" edc:name="AD1D21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IF" edc:desc="" edc:mask="0x1" edc:name="AD1D27IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IF" edc:desc="" edc:mask="0x1" edc:name="AD1D48IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IF" edc:desc="" edc:mask="0x1" edc:name="AD1D49IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IF" edc:desc="" edc:mask="0x1" edc:name="AD1D50IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IF" edc:desc="" edc:mask="0x1" edc:name="AD1D51IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IF" edc:desc="" edc:mask="0x1" edc:name="AD1D52IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IF" edc:desc="" edc:mask="0x1" edc:name="AD1D53IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfc7007fc" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="-----nnnnnnnn------------nnn-nnn" edc:cname="IFS5" edc:desc="" edc:impl="0x7f80077" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000------------000-000" edc:name="IFS5" edc:nzwidth="32" edc:por="-----00000000------------000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP4IF" edc:desc="" edc:mask="0x1" edc:name="CMP4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP5IF" edc:desc="" edc:mask="0x1" edc:name="CMP5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="I2C3BIF" edc:desc="" edc:mask="0x1" edc:name="I2C3BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:desc="" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:desc="" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATAEEIF" edc:desc="" edc:mask="0x1" edc:name="DATAEEIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe7fffe7f" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100A0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="IFS6" edc:desc="" edc:impl="0xfffffffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu00uu0000000u000000000u--" edc:name="IFS6" edc:nzwidth="32" edc:por="xxxxxxxx00xx0000000x000000000x--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10EIF" edc:mask="0x1" edc:name="IC10EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10IF" edc:mask="0x1" edc:name="IC10IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC10IF" edc:mask="0x1" edc:name="OC10IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11EIF" edc:mask="0x1" edc:name="IC11EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11IF" edc:mask="0x1" edc:name="IC11IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11IF" edc:mask="0x1" edc:name="OC11IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12EIF" edc:mask="0x1" edc:name="IC12EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12IF" edc:mask="0x1" edc:name="IC12IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12IF" edc:mask="0x1" edc:name="OC12IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13EIF" edc:mask="0x1" edc:name="IC13EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13IF" edc:mask="0x1" edc:name="IC13IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13IF" edc:mask="0x1" edc:name="OC13IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14EIF" edc:mask="0x1" edc:name="IC14EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14IF" edc:mask="0x1" edc:name="IC14IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14IF" edc:mask="0x1" edc:name="OC14IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15EIF" edc:mask="0x1" edc:name="IC15EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15IF" edc:mask="0x1" edc:name="IC15IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15IF" edc:mask="0x1" edc:name="OC15IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16EIF" edc:mask="0x1" edc:name="IC16EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16IF" edc:mask="0x1" edc:name="IC16IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16IF" edc:mask="0x1" edc:name="OC16IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
