Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPD064.PIC
      <edc:SFRDef edc:_addr="0x1F810100" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnn--------------------nnnn--" edc:cname="IEC4" edc:desc="" edc:impl="0xfc00003c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--------------------0000--" edc:name="IEC4" edc:nzwidth="32" edc:por="000000--------------------0000--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AD1D24IE" edc:desc="" edc:mask="0x1" edc:name="AD1D24IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IE" edc:desc="" edc:mask="0x1" edc:name="AD1D25IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IE" edc:desc="" edc:mask="0x1" edc:name="AD1D21IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IE" edc:desc="" edc:mask="0x1" edc:name="AD1D27IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IE" edc:desc="" edc:mask="0x1" edc:name="AD1D48IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IE" edc:desc="" edc:mask="0x1" edc:name="AD1D49IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IE" edc:desc="" edc:mask="0x1" edc:name="AD1D50IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IE" edc:desc="" edc:mask="0x1" edc:name="AD1D51IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IE" edc:desc="" edc:mask="0x1" edc:name="AD1D52IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IE" edc:desc="" edc:mask="0x1" edc:name="AD1D53IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfc7007fc" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810110" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="-----nnnnnnnn------------nnn-nnn" edc:cname="IEC5" edc:desc="" edc:impl="0x7f80077" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000------------000-000" edc:name="IEC5" edc:nzwidth="32" edc:por="-----00000000------------000-000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IE" edc:desc="" edc:mask="0x1" edc:name="CMP3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP4IE" edc:desc="" edc:mask="0x1" edc:name="CMP4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP5IE" edc:desc="" edc:mask="0x1" edc:name="CMP5IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U6EIE" edc:desc="" edc:mask="0x1" edc:name="U6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIE" edc:desc="" edc:mask="0x1" edc:name="U6RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIE" edc:desc="" edc:mask="0x1" edc:name="U6TXIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="I2C3BIE" edc:desc="" edc:mask="0x1" edc:name="I2C3BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIE" edc:desc="" edc:mask="0x1" edc:name="I2C3SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIE" edc:desc="" edc:mask="0x1" edc:name="I2C3MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IE" edc:desc="" edc:mask="0x1" edc:name="DMA4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IE" edc:desc="" edc:mask="0x1" edc:name="DMA5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IE" edc:desc="" edc:mask="0x1" edc:name="DMA6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IE" edc:desc="" edc:mask="0x1" edc:name="DMA7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATAEEIE" edc:desc="" edc:mask="0x1" edc:name="DATAEEIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe7fffe7f" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810120" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="IEC6" edc:desc="" edc:impl="0xfffffffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu00uu0000000u000000000u--" edc:name="IEC6" edc:nzwidth="32" edc:por="xxxxxxxx00xx0000000x000000000x--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIE" edc:mask="0x1" edc:name="I2C4BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIE" edc:mask="0x1" edc:name="I2C4SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIE" edc:mask="0x1" edc:name="I2C4MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10EIE" edc:mask="0x1" edc:name="IC10EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10IE" edc:mask="0x1" edc:name="IC10IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC10IE" edc:mask="0x1" edc:name="OC10IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11EIE" edc:mask="0x1" edc:name="IC11EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11IE" edc:mask="0x1" edc:name="IC11IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11IE" edc:mask="0x1" edc:name="OC11IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12EIE" edc:mask="0x1" edc:name="IC12EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12IE" edc:mask="0x1" edc:name="IC12IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12IE" edc:mask="0x1" edc:name="OC12IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13EIE" edc:mask="0x1" edc:name="IC13EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13IE" edc:mask="0x1" edc:name="IC13IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13IE" edc:mask="0x1" edc:name="OC13IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14EIE" edc:mask="0x1" edc:name="IC14EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14IE" edc:mask="0x1" edc:name="IC14IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14IE" edc:mask="0x1" edc:name="OC14IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15EIE" edc:mask="0x1" edc:name="IC15EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15IE" edc:mask="0x1" edc:name="IC15IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15IE" edc:mask="0x1" edc:name="OC15IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16EIE" edc:mask="0x1" edc:name="IC16EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16IE" edc:mask="0x1" edc:name="IC16IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16IE" edc:mask="0x1" edc:name="OC16IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIE" edc:mask="0x1" edc:name="SPI4EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIE" edc:mask="0x1" edc:name="SPI4RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIE" edc:mask="0x1" edc:name="SPI4TXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
